package java_study_1212;

class 붕어빵기계{
   int 붕어빵가격;
   String 붕어빵종류; //팥,슈크림
   
   //기본생성자가 설정되어있습니다.
   붕어빵기계(int 붕어빵가격, String 붕어빵종류){
      //퀴즈. 필드변수 값을 초기화 할 수 있게 이어서 코딩해보세요.
      this.붕어빵가격 = 붕어빵가격;
      this.붕어빵종류 = 붕어빵종류;
   }
   //메소드, 리턴타입이 'String', 메소드명은 붕어빵내용물추가
   public String 붕어빵내용물추가(String 재료1, String 재료2){
      String 최종재료 = 재료1 + 재료2;
      return 최종재료;
   }
}

public class 붕어빵 {

   public static void main(String[] args) {
      
      붕어빵기계 길동이네붕어빵 = new 붕어빵기계(1000, "팥");//붕어빵기계 클래스 호출
      System.out.println("붕어빵 가격 : "+길동이네붕어빵.붕어빵가격);
      System.out.println("붕어빵 종류 : "+길동이네붕어빵.붕어빵종류);
   
      String 최종재료 = 길동이네붕어빵.붕어빵내용물추가("치즈","파인애플"); //메소드 호출
      길동이네붕어빵.붕어빵종류 = 길동이네붕어빵.붕어빵종류 + 최종재료 + "붕어빵";
      길동이네붕어빵.붕어빵가격 = 3000;
      //팥+치즈+파인애플 붕어빵을 다시 '붕어빵종류' 필드변수에 대입
      System.out.println("붕어빵 종류 : "+길동이네붕어빵.붕어빵종류);
      System.out.println("붕어빵 가격 : "+길동이네붕어빵.붕어빵가격);
      
   }
}
